spec/dummy/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_hash", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new
    @user.username = params[:user][:username]
    @user.password_hash = SecureRandom.hex(32)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_hash" = 'ed6571488522e3160832367e1f1526639304937ab33011e28cd1b628fd195bf1', "updated_at" = '2014-03-27 17:27:51.882492' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    @user.username = params[:user][:username]
    @user.password_hash = SecureRandom.hex(32)

    respond_to do |format|
      if @user.save